HELLO = (
    "Привет! Я - бот для напоминаний. Моя задача - помогать вам оставаться "
    "организованным. Вы можете добавлять в меня напоминания с указанием даты "
    "и времени по московскому времени, а я буду отправлять вам сообщения с "
    "напоминаниями в нужное время. Просто отправьте мне сообщение в формате "
    "'Добавь HH:MM DD.MM.YYYY текст напоминания.' Еще вы можете просмотреть "
    "список актуальных напоминаний командой 'Покажи' и удалить их при "
    "необходимости командой 'Удали HH:MM DD.MM.YYYY текст напоминания.' "
    "Надеюсь, я смогу быть вам полезным!"
)
NO_REMINDERS_MESSAGE = "Актуальных напоминаний нет."
INVALID_TIME_FORMAT_MESSAGE = (
    "Извините, произошла ошибка. "
    "Вы указали неактуальную дату и время или применили "
    "неверный формат даты и времени."
)
REMINDER_DELETED_MESSAGE = "Напоминание удалено."
REMINDER_NOT_FOUND_MESSAGE = "Напоминание не найдено."
INVALID_DELETE_COMMAND_FORMAT_MESSAGE = "Неверный формат команды удаления."
UNRECOGNIZED_COMMAND_MESSAGE = "Извините, я не понял команду."
